brew "bash"
brew "cmake"
brew "coreutils" if OS.mac?
brew "emacs" if OS.linux?
brew "entr"
brew "fd"
brew "fzf"
brew "git"
brew "gnupg"
brew "jq"
brew "mas" if OS.mac?
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "pinentry-mac" if OS.mac?
brew "pyenv-virtualenv"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
cask "android-studio" if OS.mac?
cask "brave-browser" if OS.mac?
cask "docker" if OS.mac?
cask "emacs-mac" if OS.mac?
cask "firefox-developer-edition" if OS.mac?
cask "font-fantasque-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-mplus-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-fira-code-nerd-font"
cask "iterm2" if OS.mac?
cask "keybase" if OS.mac?
cask "notion" if OS.mac?
cask "persepolis-download-manager" if OS.mac?
cask "pycharm" if OS.mac?
cask "spotify" if OS.mac?
cask "visual-studio-code" if OS.mac?
mas "1Password 7", id: 1333542190 if OS.mac?
mas "Magnet", id: 441258766 if OS.mac?
mas "Spark", id: 1176895641 if OS.mac?
mas "Xcode", id: 497799835 if OS.mac?
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
tap "d12frosted/emacs-plus"
