brew "bash"
brew "cmake"
brew "coreutils" if OS.mac?
brew "emacs" if OS.linux?
brew "entr"
brew "fd"
brew "fzf"
brew "git"
brew "gnupg"
brew "jq"
brew "mas"
brew "neovim"
brew "pandoc"
brew "pinentry-mac" if OS.mac?
brew "pyenv-virtualenv"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
cask "android-studio"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "emacs-mac" if OS.mac?
cask "firefox-developer-edition"
cask "font-fantasque-sans-mono"
cask "font-hack"
cask "font-m-plus"
cask "font-source-code-pro"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "keybase"
cask "notion"
cask "pycharm"
cask "visual-studio-code-insiders"
mas "1Password 7", id: 1333542190
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
