brew "bash"
brew "cmake"
brew "coreutils" if OS.mac?
brew "emacs" if OS.linux?
brew "entr"
brew "fd"
brew "fzf"
brew "git"
brew "gnupg"
brew "jq"
brew "mas"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "pinentry-mac" if OS.mac?
brew "pyenv-virtualenv"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
cask "android-studio"
cask "brave-browser"
cask "docker"
# cask "emacs-mac" if OS.mac?
brew "emacs-plus", args: ["with-ctags", "with-dbus", "with-debug", "with-mailutils", "with-no-titlebar", "with-elrumo2-icon"], restart_service: :changed if OS.mac?
cask "firefox-developer-edition"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-mplus-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "keybase"
cask "notion"
cask "persepolis-download-manager"
cask "pycharm"
cask "spotify"
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "Magnet", id: 441258766
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
tap "d12frosted/emacs-plus"
